In [2]:
#IMPORT
import pandas as pd
import numpy as np
pd.__version__

'0.20.1'

In [4]:
#let's get one started
options = pd.Series(['beef','pork','fish','chicken','vegetarian'], index = ['a','b','c','d','e'])
options

a          beef
b          pork
c          fish
d       chicken
e    vegetarian
dtype: object

In [5]:
#get all of the values
options.values

array(['beef', 'pork', 'fish', 'chicken', 'vegetarian'], dtype=object)

In [6]:
#get all the indexes
options.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
#let's only select part of this thing!
options['b':'d']

b       pork
c       fish
d    chicken
dtype: object

In [23]:
#lets read in a file oooohhhhhh fancy
file = pd.read_csv('asl-background-cut_margaret.csv')
file.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
NAME     14 non-null object
YEAR     14 non-null object
LEVEL    14 non-null int64
GRADE    14 non-null object
dtypes: int64(1), object(3)
memory usage: 528.0+ bytes

In [26]:
#this pirints things out nicely
file.iloc[:10]

        NAME       YEAR  LEVEL GRADE
0    Madison  Sophomore      1     A
1        Amy  Sophomore      1     B
2       Sean  Sophomore      3     B
3       Adam   Freshman      1     A
4     Harper  Sophomore      3     B
5      David     Junior      3     A
6      Signe   Freshman      1     B
7      Sarah     Senior      5     C
8  Elizabeth  Sophomore      1     A
9    Dominic   Freshman      1     B

In [35]:
#okay, but what if I wanna make one instead of reading one?
slist = {'a':1,'b':2,'c':3,'d':4,'e':5}
comida = pd.Series(slist)
foods = ['banana','onion','peanut butter','salmon','bread']
df = pd.DataFrame({'Number': comida,'Food': foods})
df

            Food  Number
a         banana       1
b          onion       2
c  peanut butter       3
d         salmon       4
e          bread       5

In [39]:
#Let's do some splicing!
grades = pd.DataFrame(file)
grades.loc[1:3]

   NAME       YEAR  LEVEL GRADE
1   Amy  Sophomore      1     B
2  Sean  Sophomore      3     B
3  Adam   Freshman      1     A

In [45]:
#Make it bigger!
exam1 = pd.Series({'Emily': 90, 'Abby': 76,'Dom': 79, 'Natalie': 97})
exam2 = pd.Series({'Emily': 96, 'Abby': 51,'Dom': 87, 'Natalie': 78})
level = pd.Series({'Emily': 3, 'Abby': 1, 'Dom': 3, 'Natalie': 1})
scores = pd.DataFrame({'Midterm':exam1, 'Final':exam2, "ASL Class Level" :level})
scores

         ASL Class Level  Final  Midterm
Abby                   1     51       76
Dom                    3     87       79
Emily                  3     96       90
Natalie                1     78       97

In [44]:
#let's add a column that averages their test scores!
scores['Average'] = (scores['Midterm'] + scores['Final']) / 2.0
scores
#you can also use .values to show without all the pretty formatting. Just an array like fashion
#or if you want to swap rows and columns, use that with .T
#You can also create one with random values with .RandomState()

         ASL Class Level  Final  Midterm  Average
Abby                   1     51       76     63.5
Dom                    3     87       79     83.0
Emily                  3     96       90     93.0
Natalie                1     78       97     87.5